import { MainLayout } from '@/layouts/main';
import { Heading } from '@/shared/ui/heading';
import { MainContainer } from '@/shared/ui/mainContainer/MainContainer';
import Head from 'next/head';
import { ReactElement } from 'react';

const Privacy = () => {
  return (
    <>
      <Head>
        <title>Речные круизы 2023 — раннее бронирование, скидки</title>
        <meta
          name="description"
          content="Расписание речных круизов на 2023 год. Раннее бронирование со скидкой до 11%. Волго-Балтийские путешествия."
        />
        <meta
          name="keywords"
          content="Речные круизы 2023, Расписание круизов на 2023 год, навигация 2023"
        />

        <link
          rel="apple-touch-icon"
          sizes="180x180"
          href="/apple-touch-icon.png"
        />
        <link
          rel="icon"
          type="image/png"
          sizes="32x32"
          href="/favicon-32x32.png"
        />
        <link
          rel="icon"
          type="image/png"
          sizes="16x16"
          href="/favicon-16x16.png"
        />
        <link rel="manifest" href="/site.webmanifest" />
      </Head>

      <MainContainer
        px={{ base: 'section.mobile', lg: 'section.desktop' }}
        py={{ base: 'section.mobile', lg: 'section.desktop' }}
        maxW={'1400px'}
      >
        <Heading textAlign="left"> Политика конфиденциальности</Heading>
        <div>
          <p>
            Настоящая&nbsp; Политика&nbsp; конфиденциальности&nbsp;
            персональных&nbsp; данных&nbsp; (далее -Политика&nbsp;&nbsp;
            конфиденциальности)&nbsp;&nbsp; действует&nbsp; в&nbsp;
            отношении&nbsp; персональных данных, размещенных на сайте с доменным
            именем <a href="https://www.vbp.ru">vbp.ru</a> и его поддоменами
            (далее – Сайт).
          </p>
          <p>
            Использование сервисов Сайта означает согласие Пользователя с
            настоящей Политикой и указанными в ней условиями обработки его
            персональной информации; в случае несогласия с этими условиями
            Пользователь должен воздержаться от использования сервисов.
          </p>
          <p>
            Администрация сайта не проверяет достоверность персональных данных,
            предоставляемых Пользователем.
          </p>
          <p>
            <strong>1. ОБЩИЕ ПОЛОЖЕНИЯ</strong>
          </p>
          <p>
            1.1. В рамках настоящей Политики под персональной информацией
            Пользователя понимаются:
          </p>
          <p>
            1.1.1. Персональная информация, которую Пользователь предоставляет о
            себе самостоятельно при регистрации (создании учетной записи) или в
            процессе использования Сервисов, включая персональные данные
            Пользователя. Обязательная для предоставления Сервисов информация
            помечена специальным образом. Иная информация предоставляется
            Пользователем на его усмотрение. Сбор персональных данных
            производится через формы заполнения на Сайте.
          </p>
          <p>
            1.1.2. Иная информация о Пользователе, на&nbsp; обработку которой
            Пользователь дал Согласие.
          </p>
          <p>
            1.1.3.&nbsp;Данные, которые автоматически передаются сервисам Сайта
            в процессе их использования с помощью установленного на устройстве
            Пользователя программного обеспечения, носят неперсонифицированный
            характер и направлены на улучшение обслуживания клиентов, улучшения
            удобства использования сайта, анализа статистики посещаемости,
            информирования Пользователя о новых услугах Компании (например,
            посредством отправки журналов, отправки приглашений на презентации
            услуг, сообщений о технических нововведениях и т.д.) с помощью
            различных средств связи, а именно посредством: интернет; сообщений
            на адрес электронной почты; коротких текстовых сообщений (SMS) и
            мультимедийных сообщений (MMS) на номер телефона; а также
            посредством использования информационно-коммуникационных сервисов,
            таких как Viber, WhatsApp и тому подобных; телефонных звонков.
          </p>
          <p>
            1.1.4. Настоящая Политика конфиденциальности применяется только к
            Сайту <a href="https://www.vbp.ru">vbp.ru</a>. &nbsp;Сайт{' '}
            <a href="https://www.vbp.ru">vbp.ru</a> не контролирует и не несет
            ответственности за сайты третьих лиц, на которые Пользователь может
            перейти по ссылкам, доступным на Сайте, а так же сайты третьих лиц,
            содержащие упоминание о Сайте и с которых могут делаться ссылки на
            Сайт. &nbsp;На сайтах третьих лиц может быть собственная политика
            конфиденциальности и у ее пользователя могут собираться или
            запрашиваться иные персональные данные.
          </p>
          <p>
            <strong>
              2. ЦЕЛИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ
            </strong>
          </p>
          <p>
            2.1. Сайт собирает и хранит только ту персональную информацию,
            которая необходима для предоставления сервисов или оказания услуг и
            исполнения соглашений и договоров с Пользователем, за исключением
            случаев, когда законодательством предусмотрено обязательное хранение
            персональной информации в течение определенного законом срока.
          </p>
          <p>
            2.2. Персональную информацию Пользователя Сайт обрабатывает в
            следующих целях:
          </p>
          <p>
            2.2.1. Идентификации Пользователя, зарегистрированного на Сайте,
          </p>
          <p>
            2.2.2. Предоставления Пользователю доступа к персонализированным
            ресурсам Сайта.
          </p>
          <p>
            2.2.3. Установления с Пользователем обратной связи, включая
            направление уведомлений, запросов, касающихся использования Сайта,
            оказания услуг, обработку запросов и заявок от Пользователя.
          </p>
          <p>
            2.2.4. Определения места нахождения Пользователя для обеспечения
            безопасности, предотвращения мошенничества.
          </p>
          <p>
            2.2.5. Подтверждения достоверности и полноты персональных данных,
            предоставленных Пользователем.
          </p>
          <p>
            2.2.6. Создания учетной записи для доступа в личный кабинет на
            Сайте, если Пользователь дал согласие на создание учетной записи.
          </p>
          <p>
            2.2.7. Предоставления Пользователю эффективной клиентской и
            технической поддержки при возникновении проблем, связанных с
            использованием Сайта.
          </p>
          <p>
            2.2.9. Осуществления рекламной деятельности с согласия Пользователя.
          </p>
          <p>2.2.10. Улучшения качества услуг и разработка новых.</p>
          <p>
            2.2.11. Проведения статистических и иных исследований на основе
            обезличенных неперсонифицированных &nbsp;данных.
          </p>
          <p>
            <strong>
              3. УСЛОВИЯ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЕЙ И ЕЕ
              ПЕРЕДАЧИ ТРЕТЬИМ ЛИЦАМ
            </strong>
          </p>
          <p>
            3.1. Сайт хранит персональную информацию Пользователей в
            соответствии с внутренними регламентами.
          </p>
          <p>
            3.2. В отношении персональной информации Пользователя сохраняется ее
            конфиденциальность, кроме случаев добровольного предоставления
            Пользователем информации о себе для общего доступа неограниченному
            кругу лиц. При использовании отдельных сервисов Пользователь
            соглашается с тем, что определенная часть его персональной
            информации становится общедоступной.
          </p>
          <p>
            3.3. Сайт вправе передать персональную информацию Пользователя
            третьим лицам в следующих случаях:
          </p>
          <p>3.3.1. Пользователь выразил согласие на такие действия.</p>
          <p>
            3.3.2. Передача необходима для использования Пользователем
            определенного сервиса либо для исполнения определенного соглашения
            или договора с Пользователем.
          </p>
          <p>
            3.3.4. Передача предусмотрена российским или иным применимым
            законодательством в рамках установленной законодательством
            процедуры.
          </p>
          <p>
            3.3.5. Формы, установленные на сайте, могут передавать данные как
            напрямую на сайт, так и на сайты сторонних организаций (скрипты
            сервисов сторонних организаций).
          </p>
          <p>
            3.3.6. В случае продажи Сайта к приобретателю переходят все
            обязательства по соблюдению условий настоящей Политики применительно
            к полученной им персональной информации.
          </p>
          <p>
            3.4. Обработка персональных данных Пользователя осуществляется без
            ограничения срока любым законным способом, в том числе в
            информационных системах персональных данных с использованием средств
            автоматизации или без использования таких средств. Обработка
            персональных данных Пользователей осуществляется в соответствии с
            Федеральным{' '}
            <a
              href="https://login.consultant.ru/link/?req=doc;base=ROS;n=213190;fld=134&amp;roistat_visit=15433210"
              target="_blank"
              rel="noreferrer"
            >
              законом
            </a>{' '}
            от 27.07.2006 N 152-ФЗ &laquo;О&nbsp;персональных данных&raquo;.
          </p>
          <p>
            3.5. Администрация Сайта принимает необходимые организационные и
            технические меры для защиты персональной информации Пользователя от
            неправомерного или случайного доступа, уничтожения, изменения,
            блокирования, копирования, распространения, а также от иных
            неправомерных действий третьих лиц.
          </p>
          <p>
            3.6. Администрация Сайта совместно с Пользователем принимает все
            необходимые меры по предотвращению отрицательных последствий,
            вызванных утратой или разглашением персональных данных Пользователя.
          </p>
          <p>
            <strong>4. ОБЯЗАТЕЛЬСТВА СТОРОН</strong>
          </p>
          <p>4.1. Пользователь обязан:</p>
          <p>
            4.1.1. Предоставить информацию о персональных данных, необходимую
            для пользования Сайтом.
          </p>
          <p>
            4.1.2. Обновлять, дополнять предоставленную информацию о
            персональных данных в случае изменения данной информации.
          </p>
          <p>
            4.1.3. Принимать меры защиты от доступа третьих лиц к своей учетной
            записи (логина, пароля).
          </p>
          <p>4.2. Администрация Сайта обязана:</p>
          <p>
            4.2.1. Использовать полученную информацию исключительно для целей,
            указанных в настоящей Политике конфиденциальности.
          </p>
          <p>
            4.2.2. Обеспечить хранение конфиденциальной информации в тайне, не
            разглашать без предварительного письменного разрешения Пользователя,
            а также не осуществлять продажу, обмен, опубликование либо
            разглашение иными возможными способами переданных персональных
            данных Пользователя, за исключением предусмотренных настоящей
            Политикой конфиденциальности.
          </p>
          <p>
            4.2.3. Принимать меры предосторожности для защиты конфиденциальности
            персональных данных Пользователя согласно порядку, обычно
            используемому для защиты такого рода информации в существующем
            деловом обороте.
          </p>
          <p>
            4.2.4. Осуществить блокирование персональных данных, относящихся к
            соответствующему Пользователю, с момента обращения или запроса
            Пользователя или его законного представителя либо уполномоченного
            органа по защите прав субъектов персональных данных на период
            проверки в случае выявления недостоверных персональных данных или
            неправомерных действий.
          </p>
          <p>
            4.3. В случае утраты или разглашения конфиденциальной информации
            Администрация Сайта не несет ответственности, если данная
            конфиденциальная информация стала публичным достоянием до ее утраты
            или разглашения, была получена от третьей стороны до момента ее
            получения Администрацией Сайта, была разглашена с согласия
            Пользователя.
          </p>
          <p>
            <strong>6. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</strong>
          </p>
          <p>
            6.1. Администрация Сайта вправе вносить изменения в настоящую
            Политику конфиденциальности без согласия Пользователя.
          </p>
          <p>
            6.2. Все предложения или вопросы по настоящей Политике
            конфиденциальности следует сообщать на vbp@vbp.ru.
          </p>
        </div>
      </MainContainer>
    </>
  );
};
Privacy.getLayout = function getLayout(page: ReactElement) {
  return <MainLayout>{page}</MainLayout>;
};

export default Privacy;
